---
kind: property
id: P:Autodesk.Revit.DB.HomeCamera.RightAngleOfFieldOfView
source: html/5907fd04-f037-5ffa-e406-0bea2ac079b1.htm
---
# Autodesk.Revit.DB.HomeCamera.RightAngleOfFieldOfView Property

The right angle of the field of view.

## Syntax (C#)
```csharp
public double RightAngleOfFieldOfView { get; }
```